GopalSaraf/Practicals/PSDL/include/proc/pic18f05q40.h
// Register: I2C1SDAPPS
#define I2C1SDAPPS I2C1SDAPPS
extern volatile unsigned char           I2C1SDAPPS          __at(0x270);
#ifndef _LIB_BUILD
asm("I2C1SDAPPS equ 0270h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :3;
    };
    struct {
        unsigned I2C1SDAPPS             :6;
    };
    struct {
        unsigned I2C1SDAPPS0            :1;
        unsigned I2C1SDAPPS1            :1;
        unsigned I2C1SDAPPS2            :1;
        unsigned I2C1SDAPPS3            :1;
        unsigned I2C1SDAPPS4            :1;
        unsigned I2C1SDAPPS5            :1;
    };
} I2C1SDAPPSbits_t;
extern volatile I2C1SDAPPSbits_t I2C1SDAPPSbits __at(0x270);
// bitfield macros
#define _I2C1SDAPPS_PIN_POSN                                0x0
#define _I2C1SDAPPS_PIN_POSITION                            0x0
#define _I2C1SDAPPS_PIN_SIZE                                0x3
#define _I2C1SDAPPS_PIN_LENGTH                              0x3
#define _I2C1SDAPPS_PIN_MASK                                0x7
#define _I2C1SDAPPS_PORT_POSN                               0x3
#define _I2C1SDAPPS_PORT_POSITION                           0x3
#define _I2C1SDAPPS_PORT_SIZE                               0x3
#define _I2C1SDAPPS_PORT_LENGTH                             0x3
#define _I2C1SDAPPS_PORT_MASK                               0x38
#define _I2C1SDAPPS_I2C1SDAPPS_POSN                         0x0
#define _I2C1SDAPPS_I2C1SDAPPS_POSITION                     0x0
#define _I2C1SDAPPS_I2C1SDAPPS_SIZE                         0x6
#define _I2C1SDAPPS_I2C1SDAPPS_LENGTH                       0x6
#define _I2C1SDAPPS_I2C1SDAPPS_MASK                         0x3F
#define _I2C1SDAPPS_I2C1SDAPPS0_POSN                        0x0
#define _I2C1SDAPPS_I2C1SDAPPS0_POSITION                    0x0
#define _I2C1SDAPPS_I2C1SDAPPS0_SIZE                        0x1
#define _I2C1SDAPPS_I2C1SDAPPS0_LENGTH                      0x1
#define _I2C1SDAPPS_I2C1SDAPPS0_MASK                        0x1
#define _I2C1SDAPPS_I2C1SDAPPS1_POSN                        0x1
#define _I2C1SDAPPS_I2C1SDAPPS1_POSITION                    0x1
#define _I2C1SDAPPS_I2C1SDAPPS1_SIZE                        0x1
#define _I2C1SDAPPS_I2C1SDAPPS1_LENGTH                      0x1
#define _I2C1SDAPPS_I2C1SDAPPS1_MASK                        0x2
#define _I2C1SDAPPS_I2C1SDAPPS2_POSN                        0x2
#define _I2C1SDAPPS_I2C1SDAPPS2_POSITION                    0x2
#define _I2C1SDAPPS_I2C1SDAPPS2_SIZE                        0x1
#define _I2C1SDAPPS_I2C1SDAPPS2_LENGTH                      0x1
#define _I2C1SDAPPS_I2C1SDAPPS2_MASK                        0x4
#define _I2C1SDAPPS_I2C1SDAPPS3_POSN                        0x3
#define _I2C1SDAPPS_I2C1SDAPPS3_POSITION                    0x3
#define _I2C1SDAPPS_I2C1SDAPPS3_SIZE                        0x1
#define _I2C1SDAPPS_I2C1SDAPPS3_LENGTH                      0x1
#define _I2C1SDAPPS_I2C1SDAPPS3_MASK                        0x8
#define _I2C1SDAPPS_I2C1SDAPPS4_POSN                        0x4
#define _I2C1SDAPPS_I2C1SDAPPS4_POSITION                    0x4
#define _I2C1SDAPPS_I2C1SDAPPS4_SIZE                        0x1
#define _I2C1SDAPPS_I2C1SDAPPS4_LENGTH                      0x1
#define _I2C1SDAPPS_I2C1SDAPPS4_MASK                        0x10
#define _I2C1SDAPPS_I2C1SDAPPS5_POSN                        0x5
#define _I2C1SDAPPS_I2C1SDAPPS5_POSITION                    0x5
#define _I2C1SDAPPS_I2C1SDAPPS5_SIZE                        0x1
#define _I2C1SDAPPS_I2C1SDAPPS5_LENGTH                      0x1
#define _I2C1SDAPPS_I2C1SDAPPS5_MASK                        0x20

// Register: I2C1SCLPPS
#define I2C1SCLPPS I2C1SCLPPS
extern volatile unsigned char           I2C1SCLPPS          __at(0x271);
#ifndef _LIB_BUILD
asm("I2C1SCLPPS equ 0271h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :3;
    };
    struct {
        unsigned I2C1SCLPPS             :6;
    };
    struct {
        unsigned I2C1SCLPPS0            :1;
        unsigned I2C1SCLPPS1            :1;
        unsigned I2C1SCLPPS2            :1;
        unsigned I2C1SCLPPS3            :1;
        unsigned I2C1SCLPPS4            :1;
        unsigned I2C1SCLPPS5            :1;
    };
} I2C1SCLPPSbits_t;
extern volatile I2C1SCLPPSbits_t I2C1SCLPPSbits __at(0x271);
// bitfield macros
#define _I2C1SCLPPS_PIN_POSN                                0x0
#define _I2C1SCLPPS_PIN_POSITION                            0x0
#define _I2C1SCLPPS_PIN_SIZE                                0x3
#define _I2C1SCLPPS_PIN_LENGTH                              0x3
#define _I2C1SCLPPS_PIN_MASK                                0x7
#define _I2C1SCLPPS_PORT_POSN                               0x3
#define _I2C1SCLPPS_PORT_POSITION                           0x3
#define _I2C1SCLPPS_PORT_SIZE                               0x3
#define _I2C1SCLPPS_PORT_LENGTH                             0x3
#define _I2C1SCLPPS_PORT_MASK                               0x38
#define _I2C1SCLPPS_I2C1SCLPPS_POSN                         0x0
#define _I2C1SCLPPS_I2C1SCLPPS_POSITION                     0x0
#define _I2C1SCLPPS_I2C1SCLPPS_SIZE                         0x6
#define _I2C1SCLPPS_I2C1SCLPPS_LENGTH                       0x6
#define _I2C1SCLPPS_I2C1SCLPPS_MASK                         0x3F
#define _I2C1SCLPPS_I2C1SCLPPS0_POSN                        0x0
#define _I2C1SCLPPS_I2C1SCLPPS0_POSITION                    0x0
#define _I2C1SCLPPS_I2C1SCLPPS0_SIZE                        0x1
#define _I2C1SCLPPS_I2C1SCLPPS0_LENGTH                      0x1
#define _I2C1SCLPPS_I2C1SCLPPS0_MASK                        0x1
#define _I2C1SCLPPS_I2C1SCLPPS1_POSN                        0x1
#define _I2C1SCLPPS_I2C1SCLPPS1_POSITION                    0x1
#define _I2C1SCLPPS_I2C1SCLPPS1_SIZE                        0x1
#define _I2C1SCLPPS_I2C1SCLPPS1_LENGTH                      0x1
#define _I2C1SCLPPS_I2C1SCLPPS1_MASK                        0x2
#define _I2C1SCLPPS_I2C1SCLPPS2_POSN                        0x2
#define _I2C1SCLPPS_I2C1SCLPPS2_POSITION                    0x2
#define _I2C1SCLPPS_I2C1SCLPPS2_SIZE                        0x1
#define _I2C1SCLPPS_I2C1SCLPPS2_LENGTH                      0x1
#define _I2C1SCLPPS_I2C1SCLPPS2_MASK                        0x4
#define _I2C1SCLPPS_I2C1SCLPPS3_POSN                        0x3
#define _I2C1SCLPPS_I2C1SCLPPS3_POSITION                    0x3
#define _I2C1SCLPPS_I2C1SCLPPS3_SIZE                        0x1
#define _I2C1SCLPPS_I2C1SCLPPS3_LENGTH                      0x1
#define _I2C1SCLPPS_I2C1SCLPPS3_MASK                        0x8
#define _I2C1SCLPPS_I2C1SCLPPS4_POSN                        0x4
#define _I2C1SCLPPS_I2C1SCLPPS4_POSITION                    0x4
#define _I2C1SCLPPS_I2C1SCLPPS4_SIZE                        0x1
#define _I2C1SCLPPS_I2C1SCLPPS4_LENGTH                      0x1
#define _I2C1SCLPPS_I2C1SCLPPS4_MASK                        0x10
#define _I2C1SCLPPS_I2C1SCLPPS5_POSN                        0x5
#define _I2C1SCLPPS_I2C1SCLPPS5_POSITION                    0x5
#define _I2C1SCLPPS_I2C1SCLPPS5_SIZE                        0x1
#define _I2C1SCLPPS_I2C1SCLPPS5_LENGTH                      0x1
#define _I2C1SCLPPS_I2C1SCLPPS5_MASK                        0x20

// Register: U1RXPPS
#define U1RXPPS U1RXPPS
extern volatile unsigned char           U1RXPPS             __at(0x272);
#ifndef _LIB_BUILD
asm("U1RXPPS equ 0272h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :3;
    };
    struct {
        unsigned U1RXPPS                :6;
    };
    struct {
        unsigned U1RXPPS0               :1;
        unsigned U1RXPPS1               :1;
        unsigned U1RXPPS2               :1;
        unsigned U1RXPPS3               :1;
        unsigned U1RXPPS4               :1;
        unsigned U1RXPPS5               :1;
    };
} U1RXPPSbits_t;
extern volatile U1RXPPSbits_t U1RXPPSbits __at(0x272);
// bitfield macros
#define _U1RXPPS_PIN_POSN                                   0x0
#define _U1RXPPS_PIN_POSITION                               0x0
#define _U1RXPPS_PIN_SIZE                                   0x3
#define _U1RXPPS_PIN_LENGTH                                 0x3
#define _U1RXPPS_PIN_MASK                                   0x7
#define _U1RXPPS_PORT_POSN                                  0x3
#define _U1RXPPS_PORT_POSITION                              0x3
#define _U1RXPPS_PORT_SIZE                                  0x3
#define _U1RXPPS_PORT_LENGTH                                0x3
#define _U1RXPPS_PORT_MASK                                  0x38
#define _U1RXPPS_U1RXPPS_POSN                               0x0
#define _U1RXPPS_U1RXPPS_POSITION                           0x0
#define _U1RXPPS_U1RXPPS_SIZE                               0x6
#define _U1RXPPS_U1RXPPS_LENGTH                             0x6
#define _U1RXPPS_U1RXPPS_MASK                               0x3F
#define _U1RXPPS_U1RXPPS0_POSN                              0x0
#define _U1RXPPS_U1RXPPS0_POSITION                          0x0
#define _U1RXPPS_U1RXPPS0_SIZE                              0x1
#define _U1RXPPS_U1RXPPS0_LENGTH                            0x1
#define _U1RXPPS_U1RXPPS0_MASK                              0x1
#define _U1RXPPS_U1RXPPS1_POSN                              0x1
#define _U1RXPPS_U1RXPPS1_POSITION                          0x1
#define _U1RXPPS_U1RXPPS1_SIZE                              0x1
#define _U1RXPPS_U1RXPPS1_LENGTH                            0x1
#define _U1RXPPS_U1RXPPS1_MASK                              0x2
#define _U1RXPPS_U1RXPPS2_POSN                              0x2
#define _U1RXPPS_U1RXPPS2_POSITION                          0x2
#define _U1RXPPS_U1RXPPS2_SIZE                              0x1
#define _U1RXPPS_U1RXPPS2_LENGTH                            0x1
#define _U1RXPPS_U1RXPPS2_MASK                              0x4
#define _U1RXPPS_U1RXPPS3_POSN                              0x3
#define _U1RXPPS_U1RXPPS3_POSITION                          0x3
#define _U1RXPPS_U1RXPPS3_SIZE                              0x1
#define _U1RXPPS_U1RXPPS3_LENGTH                            0x1
#define _U1RXPPS_U1RXPPS3_MASK                              0x8
#define _U1RXPPS_U1RXPPS4_POSN                              0x4
#define _U1RXPPS_U1RXPPS4_POSITION                          0x4
#define _U1RXPPS_U1RXPPS4_SIZE                              0x1
#define _U1RXPPS_U1RXPPS4_LENGTH                            0x1
#define _U1RXPPS_U1RXPPS4_MASK                              0x10
#define _U1RXPPS_U1RXPPS5_POSN                              0x5
#define _U1RXPPS_U1RXPPS5_POSITION                          0x5
#define _U1RXPPS_U1RXPPS5_SIZE                              0x1
#define _U1RXPPS_U1RXPPS5_LENGTH                            0x1
#define _U1RXPPS_U1RXPPS5_MASK                              0x20

// Register: U1CTSPPS
#define U1CTSPPS U1CTSPPS
extern volatile unsigned char           U1CTSPPS            __at(0x273);
#ifndef _LIB_BUILD
asm("U1CTSPPS equ 0273h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :3;
    };
    struct {
        unsigned U1CTSPPS               :6;
    };
    struct {
        unsigned U1CTSPPS0              :1;
        unsigned U1CTSPPS1              :1;
        unsigned U1CTSPPS2              :1;
        unsigned U1CTSPPS3              :1;
        unsigned U1CTSPPS4              :1;
        unsigned U1CTSPPS5              :1;
    };
} U1CTSPPSbits_t;
extern volatile U1CTSPPSbits_t U1CTSPPSbits __at(0x273);
// bitfield macros
#define _U1CTSPPS_PIN_POSN                                  0x0
#define _U1CTSPPS_PIN_POSITION                              0x0
#define _U1CTSPPS_PIN_SIZE                                  0x3
#define _U1CTSPPS_PIN_LENGTH                                0x3
#define _U1CTSPPS_PIN_MASK                                  0x7
#define _U1CTSPPS_PORT_POSN                                 0x3
#define _U1CTSPPS_PORT_POSITION                             0x3
#define _U1CTSPPS_PORT_SIZE                                 0x3
#define _U1CTSPPS_PORT_LENGTH                               0x3
#define _U1CTSPPS_PORT_MASK                                 0x38
#define _U1CTSPPS_U1CTSPPS_POSN                             0x0
#define _U1CTSPPS_U1CTSPPS_POSITION                         0x0
#define _U1CTSPPS_U1CTSPPS_SIZE                             0x6
#define _U1CTSPPS_U1CTSPPS_LENGTH                           0x6
#define _U1CTSPPS_U1CTSPPS_MASK                             0x3F
#define _U1CTSPPS_U1CTSPPS0_POSN                            0x0
#define _U1CTSPPS_U1CTSPPS0_POSITION                        0x0
#define _U1CTSPPS_U1CTSPPS0_SIZE                            0x1
#define _U1CTSPPS_U1CTSPPS0_LENGTH                          0x1
#define _U1CTSPPS_U1CTSPPS0_MASK                            0x1
#define _U1CTSPPS_U1CTSPPS1_POSN                            0x1
#define _U1CTSPPS_U1CTSPPS1_POSITION                        0x1
#define _U1CTSPPS_U1CTSPPS1_SIZE                            0x1
#define _U1CTSPPS_U1CTSPPS1_LENGTH                          0x1
#define _U1CTSPPS_U1CTSPPS1_MASK                            0x2
#define _U1CTSPPS_U1CTSPPS2_POSN                            0x2
#define _U1CTSPPS_U1CTSPPS2_POSITION                        0x2
#define _U1CTSPPS_U1CTSPPS2_SIZE                            0x1
#define _U1CTSPPS_U1CTSPPS2_LENGTH                          0x1
#define _U1CTSPPS_U1CTSPPS2_MASK                            0x4
#define _U1CTSPPS_U1CTSPPS3_POSN                            0x3
#define _U1CTSPPS_U1CTSPPS3_POSITION                        0x3
#define _U1CTSPPS_U1CTSPPS3_SIZE                            0x1
#define _U1CTSPPS_U1CTSPPS3_LENGTH                          0x1
#define _U1CTSPPS_U1CTSPPS3_MASK                            0x8
#define _U1CTSPPS_U1CTSPPS4_POSN                            0x4
#define _U1CTSPPS_U1CTSPPS4_POSITION                        0x4
#define _U1CTSPPS_U1CTSPPS4_SIZE                            0x1
#define _U1CTSPPS_U1CTSPPS4_LENGTH                          0x1
#define _U1CTSPPS_U1CTSPPS4_MASK                            0x10
#define _U1CTSPPS_U1CTSPPS5_POSN                            0x5
#define _U1CTSPPS_U1CTSPPS5_POSITION                        0x5
#define _U1CTSPPS_U1CTSPPS5_SIZE                            0x1
#define _U1CTSPPS_U1CTSPPS5_LENGTH                          0x1
#define _U1CTSPPS_U1CTSPPS5_MASK                            0x20

