GopalSaraf/Practicals/PSDL/include/proc/pic18f05q40.h
extern volatile ADREFbits_t ADREFbits __at(0x3F8);
// bitfield macros
#define _ADREF_PREF_POSN                                    0x0
#define _ADREF_PREF_POSITION                                0x0
#define _ADREF_PREF_SIZE                                    0x4
#define _ADREF_PREF_LENGTH                                  0x4
#define _ADREF_PREF_MASK                                    0xF
#define _ADREF_NREF_POSN                                    0x4
#define _ADREF_NREF_POSITION                                0x4
#define _ADREF_NREF_SIZE                                    0x4
#define _ADREF_NREF_LENGTH                                  0x4
#define _ADREF_NREF_MASK                                    0xF0
#define _ADREF_ADPREF_POSN                                  0x0
#define _ADREF_ADPREF_POSITION                              0x0
#define _ADREF_ADPREF_SIZE                                  0x4
#define _ADREF_ADPREF_LENGTH                                0x4
#define _ADREF_ADPREF_MASK                                  0xF
#define _ADREF_ADNREF_POSN                                  0x4
#define _ADREF_ADNREF_POSITION                              0x4
#define _ADREF_ADNREF_SIZE                                  0x4
#define _ADREF_ADNREF_LENGTH                                0x4
#define _ADREF_ADNREF_MASK                                  0xF0
#define _ADREF_PREF0_POSN                                   0x0
#define _ADREF_PREF0_POSITION                               0x0
#define _ADREF_PREF0_SIZE                                   0x1
#define _ADREF_PREF0_LENGTH                                 0x1
#define _ADREF_PREF0_MASK                                   0x1
#define _ADREF_PREF1_POSN                                   0x1
#define _ADREF_PREF1_POSITION                               0x1
#define _ADREF_PREF1_SIZE                                   0x1
#define _ADREF_PREF1_LENGTH                                 0x1
#define _ADREF_PREF1_MASK                                   0x2
#define _ADREF_PREF2_POSN                                   0x2
#define _ADREF_PREF2_POSITION                               0x2
#define _ADREF_PREF2_SIZE                                   0x1
#define _ADREF_PREF2_LENGTH                                 0x1
#define _ADREF_PREF2_MASK                                   0x4
#define _ADREF_PREF3_POSN                                   0x3
#define _ADREF_PREF3_POSITION                               0x3
#define _ADREF_PREF3_SIZE                                   0x1
#define _ADREF_PREF3_LENGTH                                 0x1
#define _ADREF_PREF3_MASK                                   0x8
#define _ADREF_NREF0_POSN                                   0x4
#define _ADREF_NREF0_POSITION                               0x4
#define _ADREF_NREF0_SIZE                                   0x1
#define _ADREF_NREF0_LENGTH                                 0x1
#define _ADREF_NREF0_MASK                                   0x10
#define _ADREF_NREF1_POSN                                   0x5
#define _ADREF_NREF1_POSITION                               0x5
#define _ADREF_NREF1_SIZE                                   0x1
#define _ADREF_NREF1_LENGTH                                 0x1
#define _ADREF_NREF1_MASK                                   0x20
#define _ADREF_NREF2_POSN                                   0x6
#define _ADREF_NREF2_POSITION                               0x6
#define _ADREF_NREF2_SIZE                                   0x1
#define _ADREF_NREF2_LENGTH                                 0x1
#define _ADREF_NREF2_MASK                                   0x40
#define _ADREF_NREF3_POSN                                   0x7
#define _ADREF_NREF3_POSITION                               0x7
#define _ADREF_NREF3_SIZE                                   0x1
#define _ADREF_NREF3_LENGTH                                 0x1
#define _ADREF_NREF3_MASK                                   0x80
#define _ADREF_ADPREF0_POSN                                 0x0
#define _ADREF_ADPREF0_POSITION                             0x0
#define _ADREF_ADPREF0_SIZE                                 0x1
#define _ADREF_ADPREF0_LENGTH                               0x1
#define _ADREF_ADPREF0_MASK                                 0x1
#define _ADREF_ADPREF1_POSN                                 0x1
#define _ADREF_ADPREF1_POSITION                             0x1
#define _ADREF_ADPREF1_SIZE                                 0x1
#define _ADREF_ADPREF1_LENGTH                               0x1
#define _ADREF_ADPREF1_MASK                                 0x2
#define _ADREF_ADPREF2_POSN                                 0x2
#define _ADREF_ADPREF2_POSITION                             0x2
#define _ADREF_ADPREF2_SIZE                                 0x1
#define _ADREF_ADPREF2_LENGTH                               0x1
#define _ADREF_ADPREF2_MASK                                 0x4
#define _ADREF_ADPREF3_POSN                                 0x3
#define _ADREF_ADPREF3_POSITION                             0x3
#define _ADREF_ADPREF3_SIZE                                 0x1
#define _ADREF_ADPREF3_LENGTH                               0x1
#define _ADREF_ADPREF3_MASK                                 0x8
#define _ADREF_ADNREF0_POSN                                 0x4
#define _ADREF_ADNREF0_POSITION                             0x4
#define _ADREF_ADNREF0_SIZE                                 0x1
#define _ADREF_ADNREF0_LENGTH                               0x1
#define _ADREF_ADNREF0_MASK                                 0x10
#define _ADREF_ADNREF1_POSN                                 0x5
#define _ADREF_ADNREF1_POSITION                             0x5
#define _ADREF_ADNREF1_SIZE                                 0x1
#define _ADREF_ADNREF1_LENGTH                               0x1
#define _ADREF_ADNREF1_MASK                                 0x20
#define _ADREF_ADNREF2_POSN                                 0x6
#define _ADREF_ADNREF2_POSITION                             0x6
#define _ADREF_ADNREF2_SIZE                                 0x1
#define _ADREF_ADNREF2_LENGTH                               0x1
#define _ADREF_ADNREF2_MASK                                 0x40
#define _ADREF_ADNREF3_POSN                                 0x7
#define _ADREF_ADNREF3_POSITION                             0x7
#define _ADREF_ADNREF3_SIZE                                 0x1
#define _ADREF_ADNREF3_LENGTH                               0x1
#define _ADREF_ADNREF3_MASK                                 0x80

